      ***---
       DISPLAY-UPON-SCREEN.
           add 1 to counter
           add 1 to counter2
           if counter2 = 10
              move counter to counter-edit
              display counter-edit upon ifs-Handle at column 44 line 2
              move 0 to counter2
           end-if.
