       SD  FD2.
       01 FD2-item01.
           05 FD2-item02       PIC  9(3).
           05 FD2-item03       PIC  9(3).
           05 FD2-item04       PIC  9(3).
